app/controllers/api/v1/users_controller.rb

SELECT `users`.* FROM `users`
---
  def index
    users = User.all

INSERT INTO `users` (`first_name`, `last_name`, `email`, `created_at`, `updated_at`) VALUES ('Reuven', 'Horowitz', 'ryanhorowitz@yahoo.com', '2025-07-13 19:47:27.337619', '2025-07-13 19:47:27.337619') RETURNING `id`
---
  def create
    user = User.new(user_params)
    if user.save